; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v5 ?v4)
             (pred_4 ?v7 ?v1)
             (pred_5 ?v5 ?v1)
             (pred_10 ?v12 ?v5 )
	     (pred_1 ?v5)
             (pred_8 ?v2)
             (pred_2 ?v7)
             (pred_9 ?v1)
             (pred_11 ?v5)
             (pred_12 ?v7)
             (pred_7 ?v5)
             (pred_6 ))



(:action op_2
:parameters (?v8 ?v11 ?v10 ?v9)
:precondition (and (pred_8 ?v8) (pred_8 ?v11) (pred_2 ?v10) (pred_9 ?v9)
          (pred_3 ?v8 ?v11) (pred_4 ?v10 ?v9)
                   (pred_5 ?v11 ?v9) (pred_1 ?v8) 
                   (pred_11 ?v11) (pred_12 ?v10))
:effect (and  (pred_7 ?v11) (not (pred_11 ?v11))))


(:action op_1
:parameters (?v8 ?v6)
:precondition (and (pred_8 ?v8) (pred_8 ?v6)
               (pred_1 ?v8) (pred_3 ?v8 ?v6) (pred_7 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v8))))

(:action op_4
:parameters (?v8 ?v10)
:precondition (and (pred_8 ?v8) (pred_2 ?v10) 
                  (pred_1 ?v8) (pred_10 ?v10 ?v8) (pred_6 ))
:effect (and (pred_12 ?v10)
   (not (pred_10 ?v10 ?v8)) (not (pred_6 ))))


(:action op_5
:parameters (?v8 ?v3 ?v13)
:precondition (and (pred_8 ?v8) (pred_2 ?v3) (pred_2 ?v13)
                  (pred_1 ?v8) (pred_12 ?v13) (pred_10 ?v3 ?v8))
:effect (and (pred_12 ?v3) (pred_10 ?v13 ?v8)
        (not (pred_12 ?v13)) (not (pred_10 ?v3 ?v8))))

(:action op_3
:parameters (?v8 ?v10)
:precondition (and (pred_8 ?v8) (pred_2 ?v10) 
                  (pred_1 ?v8) (pred_12 ?v10))
:effect (and (pred_6 ) (pred_10 ?v10 ?v8) (not (pred_12 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_05 obj_17 obj_19 obj_16 obj_12 obj_21 obj_07 obj_03 obj_15 obj_13 obj_01 obj_02 obj_09 obj_10 obj_18
    obj_20 obj_11
    obj_06 obj_08 obj_14
    )

    (:init
       (pred_6)

       (pred_8 obj_04)
       (pred_8 obj_05)
       (pred_8 obj_17)
       (pred_8 obj_19)
       (pred_8 obj_16)
       (pred_8 obj_12)
       (pred_8 obj_21)
       (pred_8 obj_07)
       (pred_8 obj_03)
       (pred_8 obj_15)
       (pred_8 obj_13)
       (pred_8 obj_01)
       (pred_8 obj_02)
       (pred_8 obj_09)
       (pred_8 obj_10)
       (pred_8 obj_18)
       (pred_9 obj_20)
       (pred_9 obj_11)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_14)

       (pred_3 obj_04 obj_16)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_05 obj_17)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_17 obj_21)
       (pred_3 obj_17 obj_19)
       (pred_3 obj_17 obj_05)
       (pred_3 obj_19 obj_07)
       (pred_3 obj_19 obj_17)
       (pred_3 obj_16 obj_03)
       (pred_3 obj_16 obj_12)
       (pred_3 obj_16 obj_04)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_21)
       (pred_3 obj_12 obj_05)
       (pred_3 obj_12 obj_16)
       (pred_3 obj_21 obj_13)
       (pred_3 obj_21 obj_07)
       (pred_3 obj_21 obj_17)
       (pred_3 obj_21 obj_12)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_07 obj_19)
       (pred_3 obj_07 obj_21)
       (pred_3 obj_03 obj_02)
       (pred_3 obj_03 obj_15)
       (pred_3 obj_03 obj_16)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_13)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_15 obj_03)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_01)
       (pred_3 obj_13 obj_21)
       (pred_3 obj_13 obj_15)
       (pred_3 obj_01 obj_18)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_01 obj_13)
       (pred_3 obj_02 obj_09)
       (pred_3 obj_02 obj_03)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_02)
       (pred_3 obj_10 obj_18)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_18 obj_01)
       (pred_3 obj_18 obj_10)
       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_03)
       (pred_5  obj_21 obj_20)
       (pred_5  obj_18 obj_11)
       (pred_5  obj_03 obj_11)
       (pred_7 obj_04)
       (pred_7 obj_05)
       (pred_7 obj_17)
       (pred_7 obj_19)
       (pred_7 obj_16)
       (pred_7 obj_12)
       (pred_7 obj_07)
       (pred_7 obj_15)
       (pred_7 obj_13)
       (pred_7 obj_01)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_10)

       (pred_4  obj_06 obj_20)
       (pred_4  obj_08 obj_11)
       (pred_4  obj_14 obj_11)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_08 obj_07)
       (pred_10 obj_14 obj_01)
       (pred_1 obj_12)
    )

    (:goal (and
       (pred_10 obj_08 obj_05)
    ))
(:constraints
  (always (not (pred_1 obj_17)))
)
)

; plan
1. (op_1 obj_12 obj_15)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_15)
   goals met: 0 of 1
2. (op_1 obj_15 obj_13)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_13)
   goals met: 0 of 1
3. (op_1 obj_13 obj_01)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_01)
   goals met: 0 of 1
4. (op_1 obj_01 obj_07)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_07)
   goals met: 0 of 1
5. (op_4 obj_07 obj_08)
   deleted: (pred_10 obj_08 obj_07) (pred_6)
   added: (pred_12 obj_08)
   goals met: 0 of 1
6. (op_1 obj_07 obj_01)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_01)
   goals met: 0 of 1
7. (op_1 obj_01 obj_13)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_13)
   goals met: 0 of 1
8. (op_1 obj_13 obj_15)
   deleted: (pred_1 obj_13)
   added: (pred_1 obj_15)
   goals met: 0 of 1
9. (op_1 obj_15 obj_12)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_12)
   goals met: 0 of 1
10. (op_1 obj_12 obj_05)
   deleted: (pred_1 obj_12)
   added: (pred_1 obj_05)
   goals met: 0 of 1
11. (op_5 obj_05 obj_06 obj_08)
   deleted: (pred_12 obj_08) (pred_10 obj_06 obj_05)
   added: (pred_12 obj_06) (pred_10 obj_08 obj_05)
   goals met: 1 of 1
